; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v10)
             (pred_1 ?v8 ?v2)
             (pred_8 ?v4 ?v2)
             (pred_3 ?v6 ?v4 )
	     (pred_11 ?v4)
             (pred_6 ?v9)
             (pred_9 ?v8)
             (pred_7 ?v2)
             (pred_2 ?v4)
             (pred_10 ?v8)
             (pred_12 ?v4)
             (pred_4 ))



(:action op_3
:parameters (?v7 ?v11 ?v3 ?v12)
:precondition (and (pred_6 ?v7) (pred_6 ?v11) (pred_9 ?v3) (pred_7 ?v12)
          (pred_5 ?v7 ?v11) (pred_1 ?v3 ?v12)
                   (pred_8 ?v11 ?v12) (pred_11 ?v7) 
                   (pred_2 ?v11) (pred_10 ?v3))
:effect (and  (pred_12 ?v11) (not (pred_2 ?v11))))


(:action op_2
:parameters (?v7 ?v1)
:precondition (and (pred_6 ?v7) (pred_6 ?v1)
               (pred_11 ?v7) (pred_5 ?v7 ?v1) (pred_12 ?v1))
:effect (and (pred_11 ?v1) (not (pred_11 ?v7))))

(:action op_4
:parameters (?v7 ?v3)
:precondition (and (pred_6 ?v7) (pred_9 ?v3) 
                  (pred_11 ?v7) (pred_3 ?v3 ?v7) (pred_4 ))
:effect (and (pred_10 ?v3)
   (not (pred_3 ?v3 ?v7)) (not (pred_4 ))))


(:action op_5
:parameters (?v7 ?v5 ?v13)
:precondition (and (pred_6 ?v7) (pred_9 ?v5) (pred_9 ?v13)
                  (pred_11 ?v7) (pred_10 ?v13) (pred_3 ?v5 ?v7))
:effect (and (pred_10 ?v5) (pred_3 ?v13 ?v7)
        (not (pred_10 ?v13)) (not (pred_3 ?v5 ?v7))))

(:action op_1
:parameters (?v7 ?v3)
:precondition (and (pred_6 ?v7) (pred_9 ?v3) 
                  (pred_11 ?v7) (pred_10 ?v3))
:effect (and (pred_4 ) (pred_3 ?v3 ?v7) (not (pred_10 ?v3)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_22 obj_08 obj_27 obj_04 obj_09 obj_15 obj_24 obj_07 obj_05 obj_20 obj_01 obj_03 obj_19 obj_28 obj_16 obj_02 obj_26 obj_21 obj_14 obj_17 obj_23 obj_06 obj_11 obj_10
    obj_18 obj_25
    obj_13 obj_12 obj_29
    )

    (:init
       (pred_4)

       (pred_6 obj_30)
       (pred_6 obj_22)
       (pred_6 obj_08)
       (pred_6 obj_27)
       (pred_6 obj_04)
       (pred_6 obj_09)
       (pred_6 obj_15)
       (pred_6 obj_24)
       (pred_6 obj_07)
       (pred_6 obj_05)
       (pred_6 obj_20)
       (pred_6 obj_01)
       (pred_6 obj_03)
       (pred_6 obj_19)
       (pred_6 obj_28)
       (pred_6 obj_16)
       (pred_6 obj_02)
       (pred_6 obj_26)
       (pred_6 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_17)
       (pred_6 obj_23)
       (pred_6 obj_06)
       (pred_6 obj_11)
       (pred_6 obj_10)
       (pred_7 obj_18)
       (pred_7 obj_25)
       (pred_9 obj_13)
       (pred_9 obj_12)
       (pred_9 obj_29)

       (pred_5 obj_30 obj_09)
       (pred_5 obj_30 obj_22)
       (pred_5 obj_22 obj_15)
       (pred_5 obj_22 obj_08)
       (pred_5 obj_22 obj_30)
       (pred_5 obj_08 obj_24)
       (pred_5 obj_08 obj_27)
       (pred_5 obj_08 obj_22)
       (pred_5 obj_27 obj_07)
       (pred_5 obj_27 obj_04)
       (pred_5 obj_27 obj_08)
       (pred_5 obj_04 obj_05)
       (pred_5 obj_04 obj_27)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_09 obj_30)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_15 obj_24)
       (pred_5 obj_15 obj_22)
       (pred_5 obj_15 obj_09)
       (pred_5 obj_24 obj_03)
       (pred_5 obj_24 obj_07)
       (pred_5 obj_24 obj_08)
       (pred_5 obj_24 obj_15)
       (pred_5 obj_07 obj_19)
       (pred_5 obj_07 obj_05)
       (pred_5 obj_07 obj_27)
       (pred_5 obj_07 obj_24)
       (pred_5 obj_05 obj_28)
       (pred_5 obj_05 obj_04)
       (pred_5 obj_05 obj_07)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_01)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_01 obj_20)
       (pred_5 obj_03 obj_26)
       (pred_5 obj_03 obj_19)
       (pred_5 obj_03 obj_24)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_19 obj_21)
       (pred_5 obj_19 obj_28)
       (pred_5 obj_19 obj_07)
       (pred_5 obj_19 obj_03)
       (pred_5 obj_28 obj_14)
       (pred_5 obj_28 obj_05)
       (pred_5 obj_28 obj_19)
       (pred_5 obj_16 obj_17)
       (pred_5 obj_16 obj_02)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_02 obj_23)
       (pred_5 obj_02 obj_26)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_02 obj_16)
       (pred_5 obj_26 obj_06)
       (pred_5 obj_26 obj_21)
       (pred_5 obj_26 obj_03)
       (pred_5 obj_26 obj_02)
       (pred_5 obj_21 obj_11)
       (pred_5 obj_21 obj_14)
       (pred_5 obj_21 obj_19)
       (pred_5 obj_21 obj_26)
       (pred_5 obj_14 obj_10)
       (pred_5 obj_14 obj_28)
       (pred_5 obj_14 obj_21)
       (pred_5 obj_17 obj_23)
       (pred_5 obj_17 obj_16)
       (pred_5 obj_23 obj_06)
       (pred_5 obj_23 obj_02)
       (pred_5 obj_23 obj_17)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_26)
       (pred_5 obj_06 obj_23)
       (pred_5 obj_11 obj_10)
       (pred_5 obj_11 obj_21)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_10 obj_14)
       (pred_5 obj_10 obj_11)
       (pred_2 obj_20)
       (pred_2 obj_21)
       (pred_2 obj_30)
       (pred_8  obj_20 obj_18)
       (pred_8  obj_21 obj_25)
       (pred_8  obj_30 obj_18)
       (pred_12 obj_22)
       (pred_12 obj_08)
       (pred_12 obj_27)
       (pred_12 obj_04)
       (pred_12 obj_09)
       (pred_12 obj_15)
       (pred_12 obj_24)
       (pred_12 obj_07)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_19)
       (pred_12 obj_28)
       (pred_12 obj_16)
       (pred_12 obj_02)
       (pred_12 obj_26)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_23)
       (pred_12 obj_06)
       (pred_12 obj_11)
       (pred_12 obj_10)

       (pred_1  obj_13 obj_18)
       (pred_1  obj_12 obj_25)
       (pred_1  obj_29 obj_18)
       (pred_3 obj_13 obj_17)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_29 obj_06)
       (pred_11 obj_22)
    )

    (:goal (and
       (pred_3 obj_12 obj_01)
    ))
(:constraints
  (always (not (pred_11 obj_15)))
)
)

; plan
1. (op_2 obj_22 obj_08)
   deleted: (pred_11 obj_22)
   added: (pred_11 obj_08)
   goals met: 0 of 1
2. (op_4 obj_08 obj_12)
   deleted: (pred_3 obj_12 obj_08) (pred_4)
   added: (pred_10 obj_12)
   goals met: 0 of 1
3. (op_2 obj_08 obj_24)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_24)
   goals met: 0 of 1
4. (op_2 obj_24 obj_03)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_03)
   goals met: 0 of 1
5. (op_2 obj_03 obj_01)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_01)
   goals met: 0 of 1
6. (op_1 obj_01 obj_12)
   deleted: (pred_10 obj_12)
   added: (pred_4) (pred_3 obj_12 obj_01)
   goals met: 1 of 1
